CSI API ETABS v1

# cSelectGetSelected Method

---

Retrieves a list of selected objects

**Namespace:** ETABSv1
**Assembly:** ETABSv1 (in ETABSv1.dll) Version: 1.0.0.0 (1.27.0.0)

Syntax

C#

VB

C++

F#

Copy

    int GetSelected(
    	ref int NumberItems,
    	ref int[] ObjectType,
    	ref string[] ObjectName
    )

    Function GetSelected (
    	ByRef NumberItems As Integer,
    	ByRef ObjectType As Integer(),
    	ByRef ObjectName As String()
    ) As Integer

    Dim instance As cSelect
    Dim NumberItems As Integer
    Dim ObjectType As Integer()
    Dim ObjectName As String()
    Dim returnValue As Integer

    returnValue = instance.GetSelected(NumberItems,
    	ObjectType, ObjectName)

    int GetSelected(
    	int% NumberItems,
    	array<int>^% ObjectType,
    	array<String^>^% ObjectName
    )

    abstract GetSelected :
            NumberItems : int byref *
            ObjectType : int[] byref *
            ObjectName : string[] byref -> int

#### Parameters

NumberItems

    Type: SystemInt32
The number of selected objects

ObjectType

    Type: SystemInt32
This is an array that includes the object type of each selected object.

  1. Point object
  2. Frame object
  3. Cable object
  4. Tendon object
  5. Area object
  6. Solid object
  7. Link object

ObjectName

    Type: SystemString
This is an array that includes the name of each selected object

#### Return Value

Type: Int32
Returns zero if the selection list is successfully retrieved, otherwise it
returns a nonzero value

Remarks

See Also

#### Reference

cSelect Interface

ETABSv1 Namespace

ETABS®, SAFE®, SAP2000® and CSiBridge® are registered trademarks of Computers
and Structures, Inc.

Copyright © Computers and Structures, Inc. 2023. All rights
reserved.

support@csiamerica.com